[
  {
    "id": 1,
    "name": "Keychron Q1",
    "url": "https://keychron.fr/cdn/shop/products/Keychron-Q1-black.jpg?v=1750842829&width=900",
    "marque": "Keychron",
    "type": "Custom",
    "switches": "Gateron G Pro Red",
    "layout": "75%",
    "wireless": false,
    "rgb": true,
    "hot_swappable": true,
    "price": 169.99,
    "stock": 9,
    "rating": 4.7,
    "description": "Le Keychron Q1 est un clavier mécanique haut de gamme, conçu principalement pour les amateurs de personnalisation et les professionnels recherchant une excellente expérience de frappe. Il s'agit d'un clavier 75% (compact avec fonction F intégrée), en aluminium entièrement usiné, avec une plaque et un boîtier robustes. Il est compatible hot-swappable, ce qui permet de changer facilement les switches sans soudure. Il est aussi très apprécié pour son support natif de QMK/VIA, facilitant la reprogrammation des touches. Il est souvent loué pour sa qualité sonore (surtout après modding), sa construction premium, et son design élégant."
  },
  {
    "id": 2,
    "name": "Logitech G Pro X TKL",
    "url": "",
    "marque": "Logitech",
    "type": "Gaming",
    "switches": "GX Blue",
    "layout": "TKL",
    "wireless": false,
    "rgb": true,
    "hot_swappable": true,
    "price": 129.99,
    "stock": 12,
    "rating": 4.5,
    "description": "Le Logitech G Pro X TKL est un clavier mécanique compact (format TKL, sans pavé numérique), pensé pour les joueurs professionnels. Il offre une connexion ultra-rapide LIGHTSPEED sans fil, une construction robuste avec plaque aluminium, et des touches en PBT durables. Il est livré avec des switchs GX mécaniques interchangeables (linéaires, tactiles ou clicky selon la version), un rétroéclairage RGB personnalisable, et une autonomie jusqu’à 50h. Ce clavier est conçu pour la compétition, alliant performance, portabilité et style minimaliste."
  },
  {
    "id": 3,
    "name": "Akko 3068B Plus",
    "url": "",
    "marque": "Akko",
    "type": "Custom",
    "switches": "Akko CS Jelly Pink",
    "layout": "65%",
    "wireless": true,
    "rgb": true,
    "hot_swappable": true,
    "price": 89.99,
    "stock": 34,
    "rating": 4.3,
    "description": "Le Akko 3068B Plus est un clavier mécanique compact au format 65 % (68 touches), idéal pour les setups minimalistes. Il offre une connectivité tri-mode (Bluetooth, 2.4 GHz sans fil, et USB-C filaire), des touches en PBT double-shot durables, et des switchs hot-swappables sans soudure. Son éclairage RGB personnalisable, sa mousse interne pour une frappe plus douce, et sa bonne autonomie en font un excellent choix polyvalent pour le travail comme pour le gaming"
  },
  {
    "id": 4,
    "name": "Razer Huntsman Mini",
    "url": "",
    "marque": "Razer",
    "type": "Gaming",
    "switches": "Razer Optical Red",
    "layout": "60%",
    "wireless": false,
    "rgb": true,
    "hot_swappable": false,
    "price": 99.99,
    "stock": 18,
    "rating": 4.4,
    "description": "Le Razer Huntsman Mini est un clavier mécanique ultra‑compact 60 %, conçu avant tout pour les joueurs exigeants en quête de performance et de gain de place. Il se distingue par ses switchs optiques Razer (clicky Purple ou linéaires Red) offrant une activation ultra‑rapide à la vitesse de la lumière grâce à la technologie infrarouge. Le clavier possède une coque en aluminium, des touches en PBT doubleshot durables avec fonctions secondaires imprimées sur le côté, et un câble USB‑C détachable pour faciliter les déplacements. Il est livré avec un rétro‑éclairage RGB Chroma personnalisable (16,8 millions de couleurs), des profils onboard et la compatibilité avec Razer Synapse pour macros et effets."
  },
  {
    "id": 5,
    "name": "Ducky One 3 SF",
    "url": "",
    "marque": "Ducky",
    "type": "Gaming",
    "switches": "Cherry MX Brown",
    "layout": "65%",
    "wireless": false,
    "rgb": true,
    "hot_swappable": true,
    "price": 109.99,
    "stock": 10,
    "rating": 4.6,
    "description": "Le Ducky One 3 SF est un clavier mécanique compact au format 65 % (67 touches), alliant design soigné et qualité de frappe. Il se distingue par des switchs hot-swappables, des touches en PBT double-shot durables, un châssis solide avec mousse interne pour un son feutré, et un RGB personnalisable sans logiciel. Conçu pour les amateurs de sensation premium, il offre une excellente stabilité et une esthétique raffinée."
  },
  {
    "id": 6,
    "name": "GMK67",
    "url": "",
    "marque": "Skyloong",
    "type": "Custom",
    "switches": "Kailh Box White",
    "layout": "65%",
    "wireless": true,
    "rgb": true,
    "hot_swappable": true,
    "price": 59.99,
    "stock": 45,
    "rating": 4.2,
    "description": "Le GMK67 est un kit clavier mécanique 65 %, prêt pour personnalisation complète. Il comprend un boîtier gasket-mounted, un PCB hot-swappable 3/5 broches, un knob multimédia, et un éclairage RGB south-facing. Il offre une connectivité tri-mode (USB-C, Bluetooth 5.x, 2.4 GHz), une large compatibilité Windows/Mac, et une batterie intégrée (~3000 mAh pour 15–20 h d'autonomie)."
  },
  {
    "id": 7,
    "name": "Anne Pro 2",
    "url": "",
    "marque": "Obinslab",
    "type": "Gaming",
    "switches": "Gateron Brown",
    "layout": "60%",
    "wireless": true,
    "rgb": true,
    "hot_swappable": false,
    "price": 79.99,
    "stock": 27,
    "rating": 4.4,
    "description": "Le Obinslab Anne Pro 2 est un clavier mécanique 60 % compact, idéal pour les espaces réduits. Il offre une connectivité Bluetooth 4.0 permettant de se connecter à jusqu'à quatre appareils simultanément, ainsi qu'une connexion USB-C pour une utilisation filaire. Son éclairage RGB personnalisable par touche, contrôlable via le logiciel ObinsLab Starter, permet une personnalisation poussée de l'ambiance lumineuse."
  },
  {
    "id": 8,
    "name": "Glorious GMMK Pro",
    "url": "",
    "marque": "Glorious",
    "type": "Custom",
    "switches": "Barebone (no switches)",
    "layout": "75%",
    "wireless": false,
    "rgb": true,
    "hot_swappable": true,
    "price": 169.99,
    "stock": 7,
    "rating": 4.8,
    "description": "Le GMMK Pro est un clavier modulaire haut de gamme, offrant une construction robuste en aluminium CNC et un design gasket-mounted pour une frappe agréable et un son feutré. Il dispose d'un rotary encoder entièrement programmable, idéal pour le contrôle du volume ou d'autres fonctions multimédia. Compatible avec les firmwares QMK et VIA, ainsi que le logiciel Glorious CORE, il permet une personnalisation avancée des touches et de l'éclairage RGB. Sa connectivité USB-C assure une connexion stable et rapide. Le GMMK Pro est également hot-swappable 5 broches, permettant de changer les switches sans soudure"
  },
  {
    "id": 9,
    "name": "SteelSeries Apex Pro TKL",
    "url": "",
    "marque": "SteelSeries",
    "type": "Gaming",
    "switches": "OmniPoint Adjustable",
    "layout": "TKL",
    "wireless": false,
    "rgb": true,
    "hot_swappable": false,
    "price": 179.99,
    "stock": 5,
    "rating": 4.9,
    "description": "Le SteelSeries Apex Pro TKL Gen 3 est un clavier mécanique haut de gamme au format Tenkeyless (TKL), conçu pour les joueurs exigeants. Il est équipé des switchs OmniPoint 3.0 à effet Hall, offrant une plage d'activation réglable de 0,1 à 4 mm, permettant une personnalisation précise de la sensibilité de chaque touche. Parmi ses fonctionnalités avancées, on retrouve le Rapid Trigger pour une activation instantanée dès l'enfoncement de la touche, le Rapid Tap pour une réactivité accrue lors des pressions rapides, et le Protection Mode qui réduit la sensibilité des touches environnantes pour éviter les frappes accidentelles."
  },
  {
    "id": 10,
    "name": "Royal Kludge RK84",
    "url": "",
    "marque": "Royal Kludge",
    "type": "Custom",
    "switches": "RK Red",
    "layout": "75%",
    "wireless": true,
    "rgb": true,
    "hot_swappable": true,
    "price": 69.99,
    "stock": 40,
    "rating": 4.1,
    "description": "Le Royal Kludge RK84 est un clavier mécanique sans fil au format 75 % (84 touches), combinant compacité et fonctionnalité. Il propose trois modes de connexion : Bluetooth 5.0, 2.4 GHz via dongle USB et USB-C filaire, permettant une utilisation fluide sur divers appareils. Son batterie de 3750 mAh offre jusqu'à 200 heures d'autonomie sans rétroéclairage, avec un temps de recharge d'environ 6 à 7 heures. Le clavier est hot-swappable, compatible avec des switches 3 ou 5 broches, et est livré avec des switches RK personnalisés (bleus, bruns ou rouges)."
  },
  {
    "id": 11,
    "name": "Corsair K70 RGB MK.2",
    "url": "",
    "marque": "Corsair",
    "type": "Gaming",
    "switches": "Cherry MX Red",
    "layout": "Full Size",
    "wireless": false,
    "rgb": true,
    "hot_swappable": false,
    "price": 159.99,
    "stock": 15,
    "rating": 4.5,
    "description": "Le Corsair K70 RGB MK.2 est un clavier mécanique robuste, construit avec un châssis en aluminium anodisé pour une durabilité accrue. Il est équipé de switches Cherry MX disponibles en plusieurs variantes : Red, Brown, Blue, Silent et Speed, offrant ainsi une expérience de frappe adaptée à différents styles de jeu et de saisie. Le rétroéclairage RGB dynamique par touche permet une personnalisation complète via le logiciel iCUE, avec des effets lumineux variés et une palette de 16,8 millions de couleurs. Le clavier dispose de touches multimédia dédiées, d'une molette de volume, d'un port USB pass-through et d'un repose-poignets détachable pour un confort optimal. "
  },
  {
    "id": 12,
    "name": "Epomaker TH80",
    "url": "",
    "marque": "Epomaker",
    "type": "Custom",
    "switches": "Gateron Pro Yellow",
    "layout": "75%",
    "wireless": true,
    "rgb": true,
    "hot_swappable": true,
    "price": 95.9,
    "stock": 10,
    "rating": null,
    "description": "Le Epomaker TH80 Pro est un clavier mécanique sans fil au format 75 % (80 touches), combinant compacité et fonctionnalité. Il propose trois modes de connexion : Bluetooth 5.0, 2.4 GHz via dongle USB et USB-C filaire, permettant une utilisation fluide sur divers appareils. Son batterie de 4000 mAh offre jusqu'à 100 heures d'autonomie sans rétroéclairage, avec un temps de recharge d'environ 6 à 7 heures. Le clavier est hot-swappable, compatible avec des switches 3 ou 5 broches, et est livré avec des switches Epomaker ou Gateron Pro personnalisés (bleus, bruns, rouges, jaunes, Flamingo ou Budgerigar). Il dispose d'un encodeur rotatif entièrement programmable, idéal pour le contrôle du volume ou d'autres fonctions multimédia. "
  }
]